<?php
/*
Plugin Name: Поля заказа
Plugin URI:
Description: Изменение полей при оформлении заказа
Version:     1.0
Author:      Gleb Samsonov
Author URI:  https://developer.wordpress.org/
License:     GPL2
License URI: https://www.gnu.org/licenses/gpl-2.0.html
Text Domain: woocommerce-checkout-reorder
Domain Path: /languages
*/

add_filter( 'woocommerce_checkout_fields', 'reorder_woo_fields' );
add_filter( 'woocommerce_default_address_fields', 'reorder_default_address_fields' );

add_action('woocommerce_after_order_notes', 'agree_to_terms', 9);

function agree_to_terms() {
	?>
	<p class="form-row terms">
		<input type="checkbox" class="input-checkbox" name="agreed" id="agreed" />
		<label for="deliverycheck" class="checkbox">Я согласен(а) с политикой конфиденциальности и даю согласие на обработку моих персональных данных.</label>
	</p>
	<?php
}

add_action('woocommerce_checkout_process', 'not_agreed_to_terms');
function not_agreed_to_terms() {
	if ( ! $_POST['agreed'] )
		wc_add_notice( __( 'Для оформления заказа необходимо согласиться на обработку персональных данных' ), 'error' );
}


function reorder_default_address_fields( $fields ) {
	$fields[ 'address_1' ][ 'priority' ]    = 90;
	$fields[ 'address_1' ][ 'placeholder' ] = "Адрес: улица, номер дома, квартира и пр.";
	$fields[ 'postcode' ][ 'priority' ]     = 60;
	$fields[ 'postcode' ][ 'clear' ]        = true;
	
	return $fields;
}

function reorder_woo_fields( $fields ) {
	
	$fields2[ 'billing' ][ 'billing_first_name' ] = $fields[ 'billing' ][ 'billing_first_name' ];
	$fields2[ 'billing' ][ 'billing_last_name' ]  = $fields[ 'billing' ][ 'billing_last_name' ];
	$fields2[ 'billing' ][ 'billing_email' ]      = $fields[ 'billing' ][ 'billing_email' ];
	$fields2[ 'billing' ][ 'billing_phone' ]      = $fields[ 'billing' ][ 'billing_phone' ];
	
	$fields2[ 'billing' ][ 'billing_country' ]  = $fields[ 'billing' ][ 'billing_country' ];
	$fields2[ 'billing' ][ 'billing_postcode' ] = $fields[ 'billing' ][ 'billing_postcode' ];
	//$fields2['billing']['billing_postcode'] = $fields['billing']['billing_postcode'];
	$fields2[ 'billing' ][ 'billing_city' ]      = $fields[ 'billing' ][ 'billing_city' ];
	$fields2[ 'billing' ][ 'billing_state' ]     = $fields[ 'billing' ][ 'billing_state' ];
	$fields2[ 'billing' ][ 'billing_address_1' ] = $fields[ 'billing' ][ 'billing_address_1' ];
	//$fields2['billing']['billing_address_2'] = $fields['billing']['billing_address_2'];
	
	$fields2[ 'shipping' ][ 'shipping_first_name' ] = $fields[ 'shipping' ][ 'shipping_first_name' ];
	$fields2[ 'shipping' ][ 'shipping_last_name' ]  = $fields[ 'shipping' ][ 'shipping_last_name' ];
	$fields2[ 'shipping' ][ 'shipping_country' ]    = $fields[ 'shipping' ][ 'shipping_country' ];
	$fields2[ 'shipping' ][ 'shipping_address_1' ]  = $fields[ 'shipping' ][ 'shipping_address_1' ];
	$fields2[ 'shipping' ][ 'shipping_address_2' ]  = $fields[ 'shipping' ][ 'shipping_address_2' ];
	$fields2[ 'shipping' ][ 'shipping_city' ]       = $fields[ 'shipping' ][ 'shipping_city' ];
	$fields2[ 'shipping' ][ 'shipping_postcode' ]   = $fields[ 'shipping' ][ 'shipping_postcode' ];
	$fields2[ 'shipping' ][ 'shipping_state' ]      = $fields[ 'shipping' ][ 'shipping_state' ];
	
	// Add full width Classes and Clears to Adjustments
	$fields2[ 'billing' ][ 'billing_email' ]              = [
		'label'    => __( 'Email', 'woocommerce' ),
		'required' => true,
		'class'    => [ 'form-row-last' ],
		'clear'    => true
	];
	$fields2[ 'billing' ][ 'billing_phone' ]              = [
		'label'    => __( 'Phone', 'woocommerce' ),
		'required' => false,
		'class'    => [ 'form-row-first' ],
		'clear'    => true
	];
	$fields2[ 'billing' ][ 'billing_country' ][ 'class' ] = [ 'form-row-first' ];
	$fields2[ 'billing' ][ 'billing_country' ][ 'clear' ] = true;
	
	$fields2[ 'billing' ][ 'billing_postcode' ][ 'priority' ] = 60;
	$fields2[ 'billing' ][ 'billing_postcode' ][ 'class' ]    = [ 'form-row-last' ];
	$fields2[ 'billing' ][ 'billing_postcode' ][ 'clear' ]    = true;
	
	$fields2[ 'billing' ][ 'billing_city' ][ 'class' ]  = [ 'form-row-first' ];
	$fields2[ 'billing' ][ 'billing_state' ][ 'class' ] = [ 'form-row-last' ];
	
	$fields2[ 'billing' ][ 'billing_city' ][ 'clear' ]  = true;
	$fields2[ 'billing' ][ 'billing_state' ][ 'clear' ] = true;
	
	$fields2[ 'billing' ][ 'billing_address_1' ][ 'priority' ] = 90;
	$fields2[ 'billing' ][ 'billing_address_1' ][ 'clear' ]    = true;
	
	$fields2[ 'billing' ][ 'billing_first_name' ][ 'placeholder' ] = "Имя";
	$fields2[ 'billing' ][ 'billing_last_name' ][ 'placeholder' ]  = "Фамилия";
	$fields2[ 'billing' ][ 'billing_email' ][ 'placeholder' ]      = "Email";
	$fields2[ 'billing' ][ 'billing_phone' ][ 'placeholder' ]      = "Телефон";
	$fields2[ 'billing' ][ 'billing_country' ][ 'placeholder' ]    = "Страна";
	$fields2[ 'billing' ][ 'billing_postcode' ][ 'placeholder' ]   = "Почтовый индекс";
	$fields2[ 'billing' ][ 'billing_city' ][ 'placeholder' ]       = "Город";
	$fields2[ 'billing' ][ 'billing_state' ][ 'placeholder' ]      = "Область или регион";
	$fields2[ 'billing' ][ 'billing_address_1' ][ 'placeholder' ]  = "Адрес";
	
	$fields2[ 'order' ][ 'order_comments' ] = $fields[ 'order' ][ 'order_comments' ];
    $fields2[ 'order' ][ 'order_comments' ][ 'placeholder' ] = "Укажите свои параметры: обхват груди, талии, бёдер, а такжке рост и длину рукава.";

    $fields2[ 'account' ][ 'account_password' ] = $fields[ 'account' ][ 'account_password' ];
    //$fields2[ 'account' ][ 'account_password-2' ] = $fields[ 'account' ][ 'account_password-2' ];
	
	return $fields2;
}


add_filter( 'woocommerce_states', 'awrr_states_russia' );
function awrr_states_russia( $states ) {
   $states['RU'] = array(
      "МОСКВА"                                 => " Москва",
      "САНКТ-ПЕТЕРБУРГ"                        => " Санкт-Петербург",
      "АБАКАН"                                 => " Абакан",
      "АНАДЫРЬ"                                => " Анадырь",
      "АНАПА"                                  => " Анапа",
      "АРХАНГЕЛЬСК"                            => " Архангельск",
      "АСТРАХАНЬ"                              => " Астрахань",
      "БАЙКОНУР"                               => " Байконур",
      "БАРНАУЛ"                                => " Барнаул",
      "БЕЛГОРОД"                               => " Белгород",
      "БИРОБИДЖАН"                             => " Биробиджан",
      "БЛАГОВЕЩЕНСК"                           => " Благовещенск",
      "БРЯНСК"                                 => " Брянск",
      "ВЕЛИКИЙ НОВГОРОД"                       => " Великий Новгород",
      "ВЛАДИВОСТОК"                            => " Владивосток",
      "ВЛАДИКАВКАЗ"                            => " Владикавказ",
      "ВЛАДИМИР"                               => " Владимир",
      "ВОЛГОГРАД"                              => " Волгоград",
      "ВОЛОГДА"                                => " Вологда",
      "ВОРКУТА"                                => " Воркута",
      "ВОРОНЕЖ"                                => " Воронеж",
      "ГОРНО-АЛТАЙСК"                          => " Горно-Алтайск",
      "ГРОЗНЫЙ"                                => " Грозный",
      "ДУДИНКА"                                => " Дудинка",
      "ЕКАТЕРИНБУРГ"                           => " Екатеринбург",
      "ЕЛИЗОВО"                                => " Елизово",
      "ИВАНОВО"                                => " Иваново",
      "ИЖЕВСК"                                 => " Ижевск",
      "ИРКУТСК"                                => " Иркутск",
      "ЙОШКАР-ОЛА"                             => " Йошкар-Ола",
      "КАЗАНЬ"                                 => " Казань",
      "КАЛИНИНГРАД"                            => " Калининград",
      "КАЛУГА"                                 => " Калуга",
      "КЕМЕРОВО"                               => " Кемерово",
      "КИРОВ"                                  => " Киров",
      "КОСТРОМА"                               => " Кострома",
      "КОСТОМУКША"                             => " Костомукша",
      "КРАСНОДАР"                              => " Краснодар",
      "КРАСНОЯРСК"                             => " Красноярск",
      "КУРГАН"                                 => " Курган",
      "КУРСК"                                  => " Курск",
      "КЫЗЫЛ"                                  => " Кызыл",
      "ЛИПЕЦК"                                 => " Липецк",
      "МАГАДАН"                                => " Магадан",
      "МАГНИТОГОРСК"                           => " Магнитогорск",
      "МАЙКОП"                                 => " Майкоп",
      "МАХАЧКАЛА"                              => " Махачкала",
      "МИНЕРАЛЬНЫЕ ВОДЫ"                       => " Минеральные Воды",
      "МИРНЫЙ"                                 => " Мирный",
      "МУРМАНСК"                               => " Мурманск",
      "МЫТИЩИ"                                 => " Мытищи",
      "НАБЕРЕЖНЫЕ ЧЕЛНЫ"                       => " Набережные Челны",
      "НАДЫМ"                                  => " Надым",
      "НАЗРАНЬ"                                => " Назрань",
      "НАЛЬЧИК"                                => " Нальчик",
      "НАРЬЯН-МАР"                             => " Нарьян-Мар",
      "НИЖНЕВАРТОВСК"                          => " Нижневартовск",
      "НОВОКУЗНЕЦК"                            => " Новокузнецк",
      "НОВОРОССИЙСК"                           => " Новороссийск",
      "НОВОСИБИРСК"                            => " Новосибирск",
      "НЕРЮНГРИ"                               => " Нерюнгри",
      "НЕФТЕЮГАНСК"                            => " Нефтеюганск",
      "НИЖНИЙ НОВГОРОД"                        => " Нижний Новгород",
      "НОВЫЙ УРЕНГОЙ"                          => " Новый Уренгой",
      "НОРИЛЬСК"                               => " Норильск",
      "НОЯБРЬСК"                               => " Ноябрьск",
      "ОМСК"                                   => " Омск",
      "ОРЕНБУРГ"                               => " Оренбург",
      "ОРЁЛ"                                   => " Орел",
      "ПЕНЗА"                                  => " Пенза",
      "ПЕРМЬ"                                  => " Пермь",
      "ПЕТРОЗАВОДСК"                           => " Петрозаводск",
      "ПЕТРОПАВЛОВСК-КАМЧАТСКИЙ"               => " Петропавловск-Камчатский",
      "ПСКОВ"                                  => " Псков",
      "РОСТОВ-НА-ДОНУ"                         => " Ростов-на-Дону",
      "РЯЗАНЬ"                                 => " Рязань",
      "САЛЕХАРД"                               => " Салехард",
      "САМАРА"                                 => " Самара",
      "САРАНСК"                                => " Саранск",
      "САРАТОВ"                                => " Саратов",
      "СЕВАСТОПОЛЬ"                            => " Севастополь",
      "СИМФЕРОПОЛЬ"                            => " Симферополь",
      "СМОЛЕНСК"                               => " Смоленск",
      "СОЧИ"                                   => " Сочи",
      "СТАВРОПОЛЬ"                             => " Ставрополь",
      "СТРЕЖЕВОЙ"                              => " Стрежевой",
      "СУРГУТ"                                 => " Сургут",
      "СЫКТЫВКАР"                              => " Сыктывкар",
      "ТАМБОВ"                                 => " Тамбов",
      "ТВЕРЬ"                                  => " Тверь",
      "ТОЛЬЯТТИ"                               => " Тольятти",
      "ТОМСК"                                  => " Томск",
      "ТУЛА"                                   => " Тула",
      "ТЫНДА"                                  => " Тында",
      "ТЮМЕНЬ"                                 => " Тюмень",
      "УЛАН-УДЭ"                               => " Улан-Удэ",
      "УЛЬЯНОВСК"                              => " Ульяновск",
      "УСИНСК"                                 => " Усинск",
      "УФА"                                    => " Уфа",
      "УХТА"                                   => " Ухта",
      "ХАБАРОВСК"                              => " Хабаровск",
      "ХАНТЫ-МАНСИЙСК"                         => " Ханты-Мансийск",
      "ХОЛМСК"                                 => " Холмск",
      "ЧЕБОКСАРЫ"                              => " Чебоксары",
      "ЧЕЛЯБИНСК"                              => " Челябинск",
      "ЧЕРЕПОВЕЦ"                              => " Череповец",
      "ЧЕРКЕССК"                               => " Черкесск",
      "ЧИТА"                                   => " Чита",
      "ЭЛИСТА"                                 => " Элиста",
      "ЮЖНО-САХАЛИНСК"                         => " Южно-Сахалинск",
      "ЯКУТСК"                                 => " Якутск",
      "ЯРОСЛАВЛЬ"                              => " Ярославль",
      "АДЫГЕЯ РЕСПУБЛИКА"                      => " Адыгея респ.",
      "АЛТАЙ РЕСПУБЛИКА"                       => " Алтай респ.",
      "АЛТАЙСКИЙ КРАЙ"                         => " Алтайский край",
      "АМУРСКАЯ ОБЛАСТЬ"                       => " Амурская обл.",
      "АРХАНГЕЛЬСКАЯ ОБЛАСТЬ"                  => " Архангельская обл.",
      "АСТРАХАНСКАЯ ОБЛАСТЬ"                   => " Астраханская обл.",
      "БАШКОРТОСТАН РЕСПУБЛИКА"                => " Башкортостан респ.",
      "БЕЛГОРОДСКАЯ ОБЛАСТЬ"                   => " Белгородская обл.",
      "БРЯНСКАЯ ОБЛАСТЬ"                       => " Брянская обл.",
      "БУРЯТИЯ РЕСПУБЛИКА"                     => " Бурятия респ.",
      "ВЛАДИМИРСКАЯ ОБЛАСТЬ"                   => " Владимирская обл.",
      "ВОЛГОГРАДСКАЯ ОБЛАСТЬ"                  => " Волгоградская обл.",
      "ВОЛОГОДСКАЯ ОБЛАСТЬ"                    => " Вологодская обл.",
      "ВОРОНЕЖСКАЯ ОБЛАСТЬ"                    => " Воронежская обл.",
      "ДАГЕСТАН РЕСПУБЛИКА"                    => " Дагестан респ.",
      "ЕВРЕЙСКАЯ АВТОНОМНАЯ ОБЛАСТЬ"           => " Еврейская авт.обл.",
      "ЗАБАЙКАЛЬСКИЙ КРАЙ"                     => " Забайкальский край",
      "ИВАНОВСКАЯ ОБЛАСТЬ"                     => " Ивановская обл.",
      "ИНГУШЕТИЯ РЕСПУБЛИКА"                   => " Ингушетия респ.",
      "ИРКУТСКАЯ ОБЛАСТЬ"                      => " Иркутская обл.",
      "КАБАРДИНО-БАЛКАРСКАЯ РЕСПУБЛИКА"        => " Кабардино-Балкарская респ.",
      "КАЛИНИНГРАДСКАЯ ОБЛАСТЬ"                => " Калининградская обл.",
      "КАЛМЫКИЯ РЕСПУБЛИКА"                    => " Калмыкия респ.",
      "КАЛУЖСКАЯ ОБЛАСТЬ"                      => " Калужская обл.",
      "КАМЧАТСКИЙ КРАЙ"                        => " Камчатский край",
      "КАРАЧАЕВО-ЧЕРКЕССКАЯ РЕСПУБЛИКА"        => " Карачаево-Черкесская респ.",
      "КАРЕЛИЯ РЕСПУБЛИКА"                     => " Карелия респ.",
      "КЕМЕРОВСКАЯ ОБЛАСТЬ"                    => " Кемеровская обл.",
      "КИРОВСКАЯ ОБЛАСТЬ"                      => " Кировская обл.",
      "КОМИ РЕСПУБЛИКА"                        => " Коми респ.",
      "КОСТРОМСКАЯ ОБЛАСТЬ"                    => " Костромская обл.",
      "КРАСНОДАРСКИЙ КРАЙ"                     => " Краснодарский край",
      "КРЫМ РЕСПУБЛИКА"                        => " Крым республика",
      "КРАСНОЯРСКИЙ КРАЙ"                      => " Красноярский край",
      "КУРГАНСКАЯ ОБЛАСТЬ"                     => " Курганская обл.",
      "КУРСКАЯ ОБЛАСТЬ"                        => " Курская обл.",
      "ЛЕНИНГРАДСКАЯ ОБЛАСТЬ"                  => " Ленинградская обл.",
      "ЛИПЕЦКАЯ ОБЛАСТЬ"                       => " Липецкая обл.",
      "МАГАДАНСКАЯ ОБЛАСТЬ"                    => " Магаданская обл.",
      "МАРИЙ ЭЛ РЕСПУБЛИКА"                    => " Марий Эл респ.",
      "МОРДОВИЯ РЕСПУБЛИКА"                    => " Мордовия респ.",
      "МОСКОВСКАЯ ОБЛАСТЬ"                     => " Московская обл.",
      "МУРМАНСКАЯ ОБЛАСТЬ"                     => " Мурманская обл.",
      "НЕНЕЦКИЙ АВТОНОМНЫЙ ОКРУГ"              => " Ненецкий АО",
      "НИЖЕГОРОДСКАЯ ОБЛАСТЬ"                  => " Нижегородская обл.",
      "НОВГОРОДСКАЯ ОБЛАСТЬ"                   => " Новгородская обл.",
      "НОВОСИБИРСКАЯ ОБЛАСТЬ"                  => " Новосибирская обл.",
      "ОМСКАЯ ОБЛАСТЬ"                         => " Омская обл.",
      "ОРЕНБУРГСКАЯ ОБЛАСТЬ"                   => " Оренбургская обл.",
      "ОРЛОВСКАЯ ОБЛАСТЬ"                      => " Орловская обл.",
      "ПЕНЗЕНСКАЯ ОБЛАСТЬ"                     => " Пензенская обл.",
      "ПЕРМСКИЙ КРАЙ"                          => " Пермский край",
      "ПРИМОРСКИЙ КРАЙ"                        => " Приморский край",
      "ПСКОВСКАЯ ОБЛАСТЬ"                      => " Псковская обл.",
      "РОСТОВСКАЯ ОБЛАСТЬ"                     => " Ростовская обл.",
      "РЯЗАНСКАЯ ОБЛАСТЬ"                      => " Рязанская обл.",
      "САМАРСКАЯ ОБЛАСТЬ"                      => " Самарская обл.",
      "САРАТОВСКАЯ ОБЛАСТЬ"                    => " Саратовская обл.",
      "САХА (ЯКУТИЯ) РЕСПУБЛИКА"               => " Саха (Якутия) респ.",
      "САХАЛИНСКАЯ ОБЛАСТЬ"                    => " Сахалинская обл.",
      "СВЕРДЛОВСКАЯ ОБЛАСТЬ"                   => " Свердловская обл.",
      "СЕВЕРНАЯ ОСЕТИЯ-АЛАНИЯ РЕСПУБЛИКА"      => " Северная Осетия - Алания респ.",
      "СМОЛЕНСКАЯ ОБЛАСТЬ"                     => " Смоленская обл.",
      "СТАВРОПОЛЬСКИЙ КРАЙ"                    => " Ставропольский край",
      "ТАЙМЫРСКИЙ ДОЛГАНО-НЕНЕЦКИЙ РАЙОН"      => " Таймырский Долгано-Ненецкий р-н",
      "ТАМБОВСКАЯ ОБЛАСТЬ"                     => " Тамбовская обл.",
      "ТАТАРСТАН РЕСПУБЛИКА"                   => " Татарстан респ.",
      "ТВЕРСКАЯ ОБЛАСТЬ"                       => " Тверская обл.",
      "ТОМСКАЯ ОБЛАСТЬ"                        => " Томская обл.",
      "ТУЛЬСКАЯ ОБЛАСТЬ"                       => " Тульская обл.",
      "ТЫВА РЕСПУБЛИКА"                        => " Тыва респ.",
      "ТЮМЕНСКАЯ ОБЛАСТЬ"                      => " Тюменская обл.",
      "УДМУРТСКАЯ РЕСПУБЛИКА"                  => " Удмуртская респ.",
      "УЛЬЯНОВСКАЯ ОБЛАСТЬ"                    => " Ульяновская обл.",
      "ХАБАРОВСКИЙ КРАЙ"                       => " Хабаровский край",
      "ХАКАСИЯ РЕСПУБЛИКА"                     => " Хакасия респ.",
      "ХАНТЫ-МАНСИЙСКИЙ-ЮГРА АВТОНОМНЫЙ ОКРУГ" => " Ханты-Мансийский АО - Югра",
      "ЧЕЛЯБИНСКАЯ ОБЛАСТЬ"                    => " Челябинская обл.",
      "ЧЕЧЕНСКАЯ РЕСПУБЛИКА"                   => " Чеченская респ.",
      "ЧУВАШСКАЯ РЕСПУБЛИКА"                   => " Чувашия респ.",
      "ЧУКОТСКИЙ АВТОНОМНЫЙ ОКРУГ"             => " Чукотский АО",
      "ЯМАЛО-НЕНЕЦКИЙ АВТОНОМНЫЙ ОКРУГ"        => " Ямало-Ненецкий АО",
      "ЯРОСЛАВСКАЯ ОБЛАСТЬ"                    => " Ярославская обл.",
   );
   
   
   /*$string = '';
   foreach ($states['RU'] as $key => $value) {
     $string .= $key . ",";
   }
   echo $string;*/
   return $states;
}